source/Week 8/SCFT/app/controllers/search_controller.rb

SELECT  "locations".* FROM "locations"  WHERE "locations"."City" = 'Kathmandu' LIMIT 1
---
	def getsearchdata

		#$icityname= params[:city]
#		$ilatitude_range= params[:latitude_range]
#		$ielevation_range= params[:elevation_range]
#		$iradius_range= params[:radius_range]

		#$ilatitude_range= params[:latitude_range]
		#$ielevation_range= params[:elevation_range]
		#$iradius_range= params[:radius_range]



		@mycity = Location.find_by(City: $icityname)

SELECT "locations".* FROM "locations"  WHERE (Latitude > 29.7333148 AND Latitude < 31.7333148 AND Elevation > -11110762.354278564 AND Elevation < 11111459.645721436)
---
	def findSurrogateCity

		if $found == 0

		#get data from JS code of geocoder


			@city = $icityname
			@lat_range = $ilatitude_range
			@rad_range = $iradius_range

		#set range
			@latitude_Range_Start = $ilatitude_mycity.to_f - $ilatitude_range.to_f
			@latitude_Range_End = $ilatitude_mycity.to_f + $ilatitude_range.to_f

		#@latresults = Location.where('Latitude > ? AND Latitude < ?',@latitude_Range_Start,@latitude_Range_End)

			@elevation_Range_Start = $elevation_mycity.to_f - $ielevation_range.to_f
			@elevation_Range_End = $elevation_mycity.to_f + $ielevation_range.to_f

			@results = Location.where('Latitude > ? AND Latitude < ? AND Elevation > ? AND Elevation < ?',@latitude_Range_Start,@latitude_Range_End,@elevation_Range_Start, @elevation_Range_End)

SELECT  "locations".* FROM "locations"  WHERE "locations"."City" = 'New Delhi?lat=28.635308?lng=77.22496000000001?ltrange=10?altrange=100?maxtemp=5?mintemp=5?radrange=500' LIMIT 1
---
	def weather
		$icityname= params[:city]
		$ilatitude_range= params[:latitude_range]
		$ielevation_range= params[:elevation_range]
		$iradius_range= params[:radius_range]
		$ilatitude_mycity = params[:latitude_mycity]
		$ilongitude_mycity = params[:longitude_mycity]


	    @mycity = Location.find_by(City: $icityname)

SELECT  "locations".* FROM "locations"  WHERE "locations"."City" = 'MIDLAND' LIMIT 1
---
	def exists
		@ecity = Location.find_by(City: params[:city])