source/Week 8/SCFT/app/controllers/welcome_controller.rb

SELECT "locations".* FROM "locations"  WHERE "locations"."City" IS NULL
---
  def index
	   @results = Location.where(City: params[:city])