source/Week 8/SCFT/app/views/welcome/index.html.erb

/*
window.open( "http://127.0.0.1:3000/search/weather?text="+document.getElementById("cityname").value +  "?city="+city+"?state="+state+"?country="+country+"?lat="+place.geometry.location.lat()+"?lng="+place.geometry.location.lng()+"?ltrange="+a+"?altrange="+b+"?maxtemp="+c+"?mintemp="+d+"?radrange="+e ,"_self");
---
SELECT "locations".* FROM "locations"  WHERE "locations"."City" IS NULL